first/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
  def index
    # render plain: "I'm in the index action!"
    render json: Artwork.all