first/app/controllers/users_controller.rb

  def index
    # render plain: "I'm in the index action!"
    render json: User.all
---
SELECT "users".* FROM "users"

  def update
    user = User.find(params[:id])
    if user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "neverforget3-1@gmail.com"], ["updated_at", "2018-11-12 23:36:55.214773"], ["id", 2]]